# Add necessary data sources
tap "homebrew/cask"
tap "neovim/neovim"

# Media
cask "spotify"
cask "vlc"

# Communication
cask "gitify"
cask "screenhero"
cask "slack"
cask "vnc-viewer"

# Productivity
cask "hyper"
cask "licecap"
cask "marked"
cask "notion"
cask "skitch"

# Dev Workspaces
brew "fish"
brew "neovim"
brew "tmux"
cask "visual-studio-code"

# Dev Utilities
brew "fzf"
brew "gist"
brew "hub"
brew "jq"
brew "reattach-to-user-namespace"
brew "the_silver_searcher"
brew "tree"
brew "wget"
cask "hex-fiend"
cask "imageoptim"
cask "ngrok"

# Install docker dependencies
brew "docker"
brew "docker-machine"
cask "virtualbox"

# Design
cask "glueprint"
cask "lingo"
cask "pixelstick"
cask "sketch"

# Games
cask "minecraft"
cask "steam"

# Utilities
cask "alfred"
cask "apptrap"
cask "caffeine"
cask "flux"
cask "mojibar"
cask "phoenix"

# Google services
cask "google-backup-and-sync"
cask "google-hangouts"
cask "google-photos-backup"

# Browsing
cask "firefox"
